app/views/users/show.html.erb

	  <ul>
	      <% if Appointment.where(mentor: current_user).count > 0  %>
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."mentor_id" = 1 ORDER BY "appointments"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "appointments" WHERE "appointments"."mentor_id" = 1

	<!-- Student section below -->
	      <% if Appointment.where(student: current_user).count > 0  %>
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."student_id" = 1
SELECT COUNT(*) FROM "appointments" WHERE "appointments"."student_id" = 1