app/controllers/appointments_controller.rb

  def signup
    redirect_to(new_user_session_path) and return if !current_user
    appt = Appointment.find(params[:id])
    if appt.mentor != current_user
      appt.available = false
      appt.student = current_user
      appt.save
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "appointments" SET "available" = $1, "student_id" = $2 WHERE "appointments"."id" = $3  [["available", false], ["student_id", 3], ["id", 1]]

  def index
    redirect_to(new_user_session_path) and return if !current_user
    filter_past_appointments(Appointment.all)
    @appointments = Appointment.where(available: true)
---
SELECT "appointments".* FROM "appointments"
SELECT "appointments".* FROM "appointments" WHERE "appointments"."available" = $1  [["available", true]]

  def create
    @appointment = Appointment.new
    if @appointment.verify_datetime(params) == false
      @error = "Please enter a valid date and time."
      render('new') and return
    else
      @appointment.topic = params[:appointment][:topic]
      @appointment.start_time = @appointment.generate_start_time(params)
      @appointment.end_time = @appointment.generate_end_time(params)
      @appointment.interval = params[:appointment][:interval].to_i
      @appointment.available = true
      @appointment.mentor = current_user
      if @appointment.save
---
INSERT INTO "appointments" ("topic", "available", "start_time", "end_time", "interval", "mentor_id", "student_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["topic", "Test"], ["available", true], ["start_time", 2016-11-11 23:30:00 UTC], ["end_time", 2016-11-12 00:00:00 UTC], ["interval", 30], ["mentor_id", 1], ["student_id", 1]]

  def update
    @appointment = Appointment.find(params[:id])
    @appointment.available = true
    @appointment.student_id = nil
    @appointment.save
---
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "appointments" SET "available" = $1, "student_id" = $2 WHERE "appointments"."id" = $3  [["available", true], ["student_id", nil], ["id", 8]]

  def destroy
    Appointment.find(params[:id]).destroy
---
DELETE FROM "appointments" WHERE "appointments"."id" = $1  [["id", 2]]
SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]