app/controllers/reviews_controller.rb

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("rating", "comment", "user_id", "appointment_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["rating", 1], ["comment", "I like the way you learn..."], ["user_id", 1], ["appointment_id", 1]]
---
def create
  @appointment = Appointment.find(params[:id])
  @review = Review.new
  @review.comment = params[:comment]
  @review.rating = params[:rating]
  @review.user = current_user
  @review.appointment = @appointment
  if @review.save